In [1]:

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [2]:
import pandas as pd

In [3]:
df =pd.DataFrame(dict1)

In [4]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [6]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
df.shape

(7, 3)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [14]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [21]:
df.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [27]:
df['Gender'].nunique()

AttributeError: 'int' object has no attribute 'sum'

In [24]:
df['Gender'].unique()

'MaleFemale'

In [29]:
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [37]:
df[(df["Marks"] >= 90) & (df["Marks"] <= 100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [41]:
sum(df['Marks'].between(90,100))

4

In [43]:
df['Marks'].mean().round()

92.0

In [52]:
df['half']=df["Marks"].apply(lambda x: x/2)

In [46]:
def div(x):
    return x/2

In [51]:
df["Marks"].apply(div)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [53]:
df

      Name  Marks  Gender  half
0  Priyang     98    Male  49.0
1   Aadhya     89  Female  44.5
2   Krisha     99  Female  49.5
3   Vedant     87    Male  43.5
4   Parshv     90    Male  45.0
5   Mittal     83  Female  41.5
6  Archana     99  Female  49.5

In [64]:
df['Male_Female']=df['Gender'].replace("Male",1).replace('Female',0)

In [68]:
df['Male_Female_1']=df['Gender'].map({"Male":1,"Female":0})

In [69]:
df

      Name  Marks  Gender  half  Male_Female  Male_Female_1
0  Priyang     98    Male  49.0            1              1
1   Aadhya     89  Female  44.5            0              0
2   Krisha     99  Female  49.5            0              0
3   Vedant     87    Male  43.5            1              1
4   Parshv     90    Male  45.0            1              1
5   Mittal     83  Female  41.5            0              0
6  Archana     99  Female  49.5            0              0

In [73]:
df.drop(columns=["Male_Female_1"],inplace=True)

In [74]:
df.columns

Index(['Name', 'Marks', 'Gender', 'half', 'Male_Female'], dtype='object')

In [77]:
df.sort_values(by ="Marks",ascending =False)

      Name  Marks  Gender  half  Male_Female
2   Krisha     99  Female  49.5            0
6  Archana     99  Female  49.5            0
0  Priyang     98    Male  49.0            1
4   Parshv     90    Male  45.0            1
1   Aadhya     89  Female  44.5            0
3   Vedant     87    Male  43.5            1
5   Mittal     83  Female  41.5            0

In [84]:
df[df['Gender'] =="Female"][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99